# -----------------------------------------------------------------------------------------------------------------
# -----------------------------------------------------------------------------------------------------------------
#                                  Скрипты и данные которые отвечают за конфигурацию
# -----------------------------------------------------------------------------------------------------------------
# -----------------------------------------------------------------------------------------------------------------

# ---------------------------------------- Получение информации об ОС ---------------------------------------------

def get_platform():
    """
    Получение информации о системе - Это важно
    :return:
    """

    import platform

    # получаем нашу систему -
    platform_os = platform.system()

    # print(platform_os)

    # if 'Windows' in platform_os:
    #     platform_os = 'Windows'
    # else:
    #     platform_os = 'Linux'
    #
    return platform_os


# # получаем нашу систему -
# platform_os = get_platform()
# print(platform_os)
# Здесь парсим наш конфиг тестов


# -----------------------------------------------------------------------------------------------------------------
#                                  Здесь парсим наш конфиг тестов
# -----------------------------------------------------------------------------------------------------------------
# Здесь расположим парсер наших данных - Это очень важно
def settings_parser():
    """
    Здесь парсим наши настройки что записаны в Settings.ini

    :return:
    """
    import configparser
    import os
    # path ='/'.join((os.path.abspath(__file__).replace('\\', '/')).split('/')[:-1])
    path = '/'.join((os.path.abspath(__file__).replace('\\', '/')).split('/')[:-1])
    # print(path)
    settings = '../settings.ini'
    path = os.path.join(path, settings)
    print(path)
    # настройки берем из конфига
    parser = configparser.ConfigParser()
    parser.read(path)
    return parser


# -----------------------------------------------------------------------------------------------------------------
#                                           САМИ НАСТРОЙКИ
# -----------------------------------------------------------------------------------------------------------------
# Парсим
parser = settings_parser()

# секция конфига
config_section = 'Test'
# Вставляем нужные переменные
# АЙПИШНИК
Machine_IP = parser[config_section]['IP_address']
# ЛОГИН
Login = parser[config_section]['user_login']
# ПАРОЛЬ
Password = parser[config_section]['user_password']
# print(machine_ip)
# print(user_login)
# print(user_password)